Repository: KDE/kio-extras
Catalog: po/*/kio5_thumbnail.po
Languages: es

source: No MIME Type specified.
es: No se ha especificado el tipo MIME.

source: No or invalid size specified.
es: No se ha especificado el tamaño o no es válido.

source: Cannot create thumbnail for directory
es: No se ha podido crear la miniatura del directorio

source: No plugin specified.
es: No se ha especificado ningún complemento.

source: Cannot load ThumbCreator %1
es: No se puede cargar ThumbCreator %1

source: Cannot create thumbnail for %1
es: No se ha podido crear la miniatura de %1

source: Failed to create a thumbnail.
es: No se ha podido crear una miniatura.

source: Could not write image.
es: No se ha podido escribir la imagen.

source: Failed to attach to shared memory segment %1
es: No se ha podido adjuntar el segmento de memoria compartida %1

source: Image is too big for the shared memory segment
es: La imagen es demasiado grande para el segmento de memoria compartida
