Repository: KDE/kio-extras
Catalog: po/*/kio5_smb.po
Languages: he

# @info:whatsthis
source: <para>There are various options for authenticating on SMB shares.</para><para><placeholder>username</placeholder>: When authenticating within a home network the username on the server is sufficient</para><para><placeholder>username@domain.com</placeholder>: Modern corporate logon names are formed like e-mail addresses</para><para><placeholder>DOMAIN\username</placeholder>: For ancient corporate networks or workgroups you may need to prefix the NetBIOS domain name (pre-Windows 2000)</para><para><placeholder>anonymous</placeholder>: Anonymous logins can be attempted using empty username and password. Depending on server configuration non-empty usernames may be required</para>
he: <para>יש מגוון אפשרויות לאימות מול שרתי SMB.</para><para><placeholder>username</placeholder>: בעת אימות מול גורם בתוך הרשת הביתית שם המשתמש בשרת אמור להספיק</para><para><placeholder>username@domain.com</placeholder>: שמות כניסה של חברות מודרניות נראים כמו כתובות דוא״ל</para><para><placeholder>DOMAIN\username</placeholder>: לרשתות עתיקות בחברות או קבוצות עבודה יכול להיות שצריך להוסיף את שם התחום ב־NetBIOS (טרום Windows 2000)</para><para><placeholder>anonymous</placeholder>: אפשר לנסות להיכנס באופן אלמוני באמצעות שם משתמש וסיסמה ריקים. כתלות בהגדרות השרת שלך יכול להיות ששם המשתמש צריך לא יכול להישאר ריק</para>

source: <qt>Please enter authentication information for <b>%1</b></qt>
he: <qt>נא למלא פרטי אימות עבור <b>%1</b></qt>

source: Please enter authentication information for: Server = %1 Share = %2
he: נא למלא פרטי אימות עבור: שרת = %1 שיתוף = %2

source: %1: Unknown file type, neither directory or file.
he: %1: סוג קובץ לא ידוע, אינו קובץ או תיקייה.

source: Unable to find any workgroups in your local network. This might be caused by an enabled firewall.
he: לא ניתן למצוא קבוצות עבודה ברשת המקומית שלך. דבר זה יכול להיגרם בגלל חומת אש פעילה.

source: No media in device for %1
he: אין מדיה בכונן עבור %1

source: Could not connect to host for %1
he: לא ניתן להתחבר לשרת עבור %1

source: Error while connecting to server responsible for %1
he: שגיאה במהלך התחברות לשרת האחראי על %1

source: Share could not be found on given server
he: לא ניתן למצוא את השיתוף בשרת הנתון

source: Bad file descriptor
he: מתאר קובץ פגום

source: The given name could not be resolved to a unique server. Make sure your network is setup without any name conflicts between names used by Windows and by UNIX name resolution.
he: לא ניתן לפענח את השם הנתון לשרת מסוים. נא לבדוק שהרשת שלך מוגדרת ללא התנגשויות שמות בשימוש על ידי מערכות Windows ו־UNIX.

source: %1: Host unreachable
he: %1: מארח לא זמין

source: libsmbclient reported an error, but did not specify what the problem is. This might indicate a severe problem with your network - but also might indicate a problem with libsmbclient. If you want to help us, please provide a tcpdump of the network interface while you try to browse (be aware that it might contain private data, so do not post it if you are unsure about that - you can send it privately to the developers if they ask for it)
he: הספרייה libsmbclient דיווחה על שגיאה, אך לא ציינה מה היא. דבר זה עלול להעיד על בעיה חמורה עם הרשת שלך - אך עלול גם להעיד על בעיה עם libsmbclient. כדי לעזור לנו, נא לצרף tcpdump של ממשק הרשת שלך תוך כדי ניסיון לעיין (נא לשים לה כי זה עלול להכיל מידע אישי, לכן לא לשלוח את זה במקרה של ספק לגבי זה - אפשר לשלוח את זה בפרטיות למפתח אם הוא מבקש ממך)

# %1 is an error number, %2 either a pretty string or the number
source: Unknown error condition: [%1] %2
he: תנאי שגיאה לא מוכר: [%1] %2

source: Error occurred while trying to access %1<nl/>%2
he: שגיאה בעת הניסיון לגשת אל %1<nl/>%2

source: libsmbclient failed to create context
he: הספרייה libsmbclient נכשלה ביצירת הקשר

source: Make sure that the samba package is installed properly on your system.
he: וודא כי החבילה samba מותקנת כראוי במערכת שלך.

source: Mounting of share "%1" from host "%2" by user "%3" failed. %4
he: עגינה של השיתוף „%1” מהשרת „%2” על ידי המשתמש „%3” נכשלה. %4

source: Unmounting of mountpoint "%1" failed. %2
he: ניתוק נקודת העגינה „%1” נכשל. %2

# host entry when no pretty name is available. %1 likely is an IP address
source: Unknown Device @ <resource>%1</resource>
he: התקן לא מוכר @ <resource>%1</resource>
