Repository: KDE/kio-extras
Catalog: po/*/kio6_smb.po
Languages: lv

# @info:whatsthis
source: <para>There are various options for authenticating on SMB shares.</para><para><placeholder>username</placeholder>: When authenticating within a home network the username on the server is sufficient</para><para><placeholder>username@domain.com</placeholder>: Modern corporate logon names are formed like e-mail addresses</para><para><placeholder>DOMAIN\username</placeholder>: For ancient corporate networks or workgroups you may need to prefix the NetBIOS domain name (pre-Windows 2000)</para><para><placeholder>anonymous</placeholder>: Anonymous logins can be attempted using empty username and password. Depending on server configuration non-empty usernames may be required</para>
lv: <para>Pastāv vairākas iespējas SMB kopīgojuma autentifikācijai.</para><para><placeholder>lietotājvārds</placeholder>: autentificējoties mājas tīklā, pietiek ar servera lietotājvārdu</para><para><placeholder>lietotājvārds@domēns.lv</placeholder>: moderni korporatīvie ierakstīšanās vārdi ir veidoti līdzīgi e-pasta adresēm</para><para><placeholder>DOMĒNS\lietotājvārds</placeholder>: senos korporatīvos tīklos vai darbgrupās var būt nepieciešams priekšā pievienot „NetBIOS“ domēna vārdu (no laikiem pirms „Windows 2000“)</para><para><placeholder>anonīms</placeholder>: mēģināt ierakstīties anonīmi notiek, ja lietotājvārdu un paroli atstāj tukšu. Servera konfigurācija var noteikt, ka lietotājvārda lauku nedrīkst atstāt tukšu</para>

source: <qt>Please enter authentication information for <b>%1</b></qt>
lv: <qt>Ierakstiet <b>%1</b> autentifikācijas informāciju</qt>

source: Please enter authentication information for: Server = %1 Share = %2
lv: Ierakstiet autentifikācijas informāciju: Serveris = „%1“ Kopīgojums = „%2“

source: %1: Unknown file type, neither directory or file.
lv: %1: Nezināms datnes tips — nav ne mape, ne datne.

source: Unable to find any workgroups in your local network. This might be caused by an enabled firewall.
lv: Neizdevās atrast darbgrupas lokālajā tīklā. Tam par iemeslu var būt ieslēgts ugunsmūris.

source: No media in device for %1
lv: Ierīcē nav „%1“ datu nesēja

source: Could not connect to host for %1
lv: Neizdevās pieslēgties resursdatoram, lai piekļūtu „%1“

source: Error while connecting to server responsible for %1
lv: Kļūda, pieslēdzoties par „%1“ atbildīgajam datoram

source: Share could not be found on given server
lv: Uz norādītā servera kopīgojumu neatrada

source: Bad file descriptor
lv: Nederīgs datnes deskriptors

source: The given name could not be resolved to a unique server. Make sure your network is setup without any name conflicts between names used by Windows and by UNIX name resolution.
lv: Neizdevās identificēt unikālu serveri ar doto vārdu. Pārliecinieties, ka jūsu tīklā nav datoru nosaukumu konfliktu starp „Windows“ un UNIX.

source: %1: Host unreachable
lv: %1: resursdators nav sasniedzams

source: libsmbclient reported an error, but did not specify what the problem is. This might indicate a severe problem with your network - but also might indicate a problem with libsmbclient. If you want to help us, please provide a tcpdump of the network interface while you try to browse (be aware that it might contain private data, so do not post it if you are unsure about that - you can send it privately to the developers if they ask for it)
lv: „libsmbclient“ ziņoja par kļūdu, taču nenorādīja, kāda tā ir. Tas var nozīmēt, ka ir problēmas ar tīklu vai problēma ar „libsmbclient“. Ja vēlaties mums palīdzēt, atsūtiet „tcpdump“ programmas izmeti no pārlūkošanas laika. Uzmanību — šī izmete var saturēt personīgus datus, tādēļ, ja neesat par to pārliecināti, sūtiet to izstrādātājiem privāti, bet ne publiski.

# %1 is an error number, %2 either a pretty string or the number
source: Unknown error condition: [%1] %2
lv: Nezināms kļūdas stāvoklis: [%1] %2

source: Error occurred while trying to access %1<nl/>%2
lv: Kļūda, mēģinot piekļūt %1<nl/>%2

source: libsmbclient failed to create context
lv: „libsmbclient“ neizdevās izveidot kontekstu

source: Make sure that the samba package is installed properly on your system.
lv: Pārliecinieties, ka jūsu sistēmā ir pareizi instalēta „samba“ pakotne.

source: Mounting of share "%1" from host "%2" by user "%3" failed. %4
lv: Kopīgojuma „%1“ no datora „%2“ kā lietotājam „%3“ piemontēšana neizdevās. %4

source: Unmounting of mountpoint "%1" failed. %2
lv: Montēšanas punkta „%1“ atmontēšana neizdevās. %2

# host entry when no pretty name is available. %1 likely is an IP address
source: Unknown Device @ <resource>%1</resource>
lv: Nezināma ierīce @ <resource>%1</resource>
